<img src="http://drive.google.com/uc?export=view&id=1tpOCamr9aWz817atPnyXus8w5gJ3mIts" width=500px>

Proprietary content. Â© Great Learning. All Rights Reserved. Unauthorized use or distribution prohibited.

---
# Practice Test - Advanced Certificate in Software Engineering - IIT Madras
---

# Instructions

- You need to add the code where ever you see "`/* Add your code here */`"
- **Do not edit any of the prefilled text/code part**

## Run below cells before starting the test - Mandatory

#### Please run the below cell. Don't edit anything.

In [ ]:
!pip install --upgrade pip
!pip install ipython-sql

%load_ext sql
%sql sqlite://

#### Please run the below cell. Don't edit anything.

In [ ]:
%%sql

DROP TABLE IF EXISTS `employee`;
CREATE TABLE `employee`
(
   `empcode`      INT(4),
   `empname`     VARCHAR(15),
   `job`          VARCHAR(45),
   `hiredate`     DATE,
   `salary`       INT(6),
   `commission`   INT(6)
);

INSERT INTO `employee` values (939, 'Jim', 'SOFTWARE ENGINEER', '1980-12-17', 2800,0);
INSERT INTO `employee` values (949, 'Dwight', 'SALESMAN', '1981-02-20', 1600, 300);    
INSERT INTO `employee` values (966, 'Micheal', 'MANAGER','1981-04-02', 3570,0);
insert into `employee` values (654,'Andy','SALESMAN','1981-09-28',1250,1400);
insert into `employee` values (782,'Kevin','MANAGER','1981-06-09',2940,0);
insert into `employee` values (788,'Pam','ANALYST', '1982-12-09',3000,0);
insert into `employee` values (939,'Oscar','PRESIDENT','1981-11-17',5000,0);
insert into `employee` values (984,'Creed','SALESMAN','1981-09-08',1500,0);
insert into `employee` values (986,'Angela','SOFTWARE ENGINEER','1983-01-12',3100, 0);
insert into `employee` values (990,'Bob','TECHNICAL LEAD','1981-12-03',2950,0);
insert into `employee` values (902,'James','ANALYST','1981-12-03',3000,0);
insert into `employee` values (994,'John','SOFTWARE ENGINEER','1982-01-23',3300,0);
insert into `employee` values (991,'Wendy', 'SALESMAN','1981-02-22',500,0);
insert into `employee` values (698,'Joe', 'MANAGER','1981-05-01',3420,0);
insert into `employee` values (977,'Max', 'ANALYST','1981-05-01',2000,200);
insert into `employee` values (960,'Stanely', 'ANALYST','1992-06-21',7000,100);
insert into `employee` values (861,'Jennifer','ANALYST','1996-07-01',5000,100);

#### Please run the below cell. Don't edit anything.

In [ ]:
%%sql

select * from employee;

---

### **Refer to the `employee` table to answer the below questions**

## Question 1

Find out the lowest and highest (`salary+commission`) for each `job` in `employee` table

In [ ]:
%%sql

/* Add your code here */

## Question 2

Find out the the top three highest paying jobs (`salary+commission`) from the `employee` table.

In [ ]:
%%sql

/* Add your code here */

## Question 3

Find out all the details of `employee` with the third highest `salary`.

In [ ]:
%%sql

/* Add your code here */